### [ДЗ 1](https://github.com/MariaMayskaya/--/blob/main/рыба/Program1.cs)


##  Stack

*   **Language:** C#
*   **IDE:** Microsoft Visual Studio 2022
*   **Target Framework:** .NET 7.0
*   **UI Framework:** WPF (Windows Presentation Foundation)
*   **ORM:** Entity Framework Core 7.0

  
## Вопрос 1
Сколько элементов имеет следующий массив? 1 int[,,] numbers = new int[3, 2, 3]; Варианты ответов
1. 0
2. 1
3. 8
4. 9
5. 18

## Вопрос 2
Сколько измерений (размерность) имеет следующий массив? 1 int[,] numbers = new int[3, 3]; Варианты ответов
1. 1
2. 2
3. 3
4. 6

## Вопрос 3
Что будет выведено на консоль в результате выполнения следующего кода: 1 2 3 4 5 6

int[][] nums = new int[3][];
nums[0] = new int[2] { 1, 2 };
nums[1] = new int[3] { 3, 4, 5 }; 
nums[2] = new int[5] { 6, 7, 8, 9, 10 };
Console.WriteLine(nums[3][2]);

## Вопрос 4
Дан следующий массив

int[][] nums = new int[3][];
nums[0] = new int[2] { 1, 2 };
nums[1] = new int[3] { 3, 4, 5 }; 
nums[2] = new int[5] { 6, 7, 8, 9, 10 };
Каким образом мы можем обратиться к числу 7 в этом массиве?

Варианты ответов:
1. nums[7]
2. nums[2, 1]
3. nums[2][1]
4. nums[3]
5. nums[3, 3]
6. nums[3][3]

### Практические вопросы
## Упражнение 1

Задан следующий трехмерный массив:

int[,,] mas = { { { 1, 2 },{ 3, 4 } }, 
                { { 4, 5 }, { 6, 7 } }, 
                { { 7, 8 }, { 9, 10 } }, 
                { { 10, 11 }, { 12, 13 } }
              };
С помощью циклов переберите все элементы этого массива и выведите их на консоль в следующем виде:

{{{1 , 2} , {3 , 4}} , {{4 , 5} , {6 , 7}} , {{7 , 8}, {9 , 10}} , {{10 , 11} , {12 , 13}}}


### [ДЗ 2](https://github.com/MariaMayskaya/--/blob/main/рыба/Program2.cs)

## Упражнение 1
За каждый месяц банк начисляет к сумме вклада 7% от суммы. Напишите консольную программу, в которую пользователь вводит сумму вклада и количество месяцев. А банк вычисляет конечную сумму вклада с учетом начисления процентов за каждый месяц.
Для вычисления суммы с учетом процентов используйте цикл for. Для ввода суммы вклада используйте выражение Convert.ToDecimal(Console.ReadLine()) (сумма вклада будет представлять тип decimal).

## Упражнение 2
Перепишите предыдущую программу, только вместо цикла for используйте цикл while.

## Упражнение 3
Напишите программу, которая выводит на консоль таблицу умножения

## Упражнение 4
Напишите программу, в которую пользователь вводит два числа и выводит результат их умножения. При этом программа должны запрашивать у пользователя ввод чисел, пока оба вводимых числа не окажутся в диапазоне от 0 до 10. Если введенные числа окажутся больше 10 или меньше 0, то программа должна вывести пользователю о том, что введенные числа недопустимы, и повторно запросить у пользователя ввод двух чисел. Если введенные числа принадлежат диапазону от 0 до 10, то программа выводит результат умножения.
Для организации ввода чисел используйте бесконечный цикл while и оператор break.


### [ДЗ 3](https://github.com/MariaMayskaya/--/blob/main/рыба/Program3.cs)

## Вопрос 1
Сколько элементов имеет следующий массив?
int[,,] numbers = new int[3, 2, 3];
Варианты ответов
1.0
2.1
3.8
4.9
5.11
6.18


## Вопрос 2
Сколько измерений (размерность) имеет следующий массив?
int[,] numbers = new int[3, 3];
Варианты ответов
1.1
2.2
3.3
4.6

## Вопрос 3
Что будет выведено на консоль в результате выполнения следующего кода:
int[][] nums = new int[3][];
nums[0] = new int[2] { 1, 2 };
nums[1] = new int[3] { 3, 4, 5 }; 
nums[2] = new int[5] { 6, 7, 8, 9, 10 };
 
Console.WriteLine(nums[3][2]);

## Вопрос 4
Дан следующий массив
int[][] nums = new int[3][];
nums[0] = new int[2] { 1, 2 };
nums[1] = new int[3] { 3, 4, 5 }; 
nums[2] = new int[5] { 6, 7, 8, 9, 10 };
Каким образом мы можем обратиться к числу 7 в этом массиве?
Варианты ответов
1.nums[7]
2.nums[2, 1]
3.nums[2][1]
4.nums[3]
5.nums[3, 3]
6.nums[3][3]

### Практические вопросы

## Упражнение 1
Задан следующий трехмерный массив:

int[,,] mas = { { { 1, 2 },{ 3, 4 } }, 
                { { 4, 5 }, { 6, 7 } }, 
                { { 7, 8 }, { 9, 10 } }, 
                { { 10, 11 }, { 12, 13 } }
              };
С помощью циклов переберите все элементы этого массива и выведите их на консоль в следующем виде:

{{{1 , 2} , {3 , 4}} , {{4 , 5} , {6 , 7}} , {{7 , 8}, {9 , 10}} , {{10 , 11} , {12 , 13}}}


### [ДЗ 4](https://github.com/MariaMayskaya/--/blob/main/рыба/calc.cs)
## Задание:

Ваша задача — создать простой калькулятор, который сможет выполнять базовые арифметические операции: сложение, вычитание, умножение и деление, остаток от деления, инкремент, декремент. Калькулятор должен предоставлять пользователю возможность вводить числа и вывод всех математических действий.
Условия выполнения:
1. Ввод данных:
   • Пользователь должен вводить два числа (например, целые или дробные).
   • Пользователь должен выбирать операцию (сложение, вычитание, умножение и т.д.).
2. Операции:
   • Реализуйте следующие арифметические операции:
     • Сложение (+)
     • Вычитание (-)
     • Умножение (*)
     • Деление (/)
     •  Остаток от деления (%)
     •  Инкремент (++)
     •  Декремент (--)

   • Обработайте случай деления на ноль и выводите соответствующее сообщение.
3. Вывод результата:
   • После выполнения операции калькулятор должен выводить результат на экран.



### [ДЗ 5](https://github.com/MariaMayskaya/--/blob/main/рыба/novela.cs)
## Задание. Тема: Создание интерактивной новеллы с использованием бесконечного цикла

Ваша задача — написать интерактивную новеллу на языке C#. Ваша новелла должна включать в себя следующие элементы:
1. Бесконечный цикл: Используйте бесконечный цикл (while(true)), чтобы ваша история могла продолжаться до тех пор, пока пользователь не решит закончить её.
2. Варианты шагов: Ваша новелла должна иметь не менее 20 различных шагов (ситуаций), из которых пользователь сможет выбирать. Каждый шаг должен предлагать несколько вариантов действий, которые могут привести к различным последствиям.
3. Концовки: Ваша история должна иметь 10 различных концовок. Эти концовки могут зависеть от выбора пользователя на протяжении всей новеллы. Постарайтесь сделать так, чтобы некоторые выборы приводили к хорошим концовкам, а другие — к плохим.


